{
                                                            "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
                                                            "contentVersion": "1.0.0.0",
                                                            "parameters": {
                                                                                                                        "log_analytics_workspace": {
                                                                                                                                                                                    "type": "String",
                                                                                                                                                                                    "defaultValue": "",
                                                                                                                                                                                    "metadata": {
                                                                                                                                                                                                                                                "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
                                                                                                                                                                                    }
                                                                                                                        }
                                                            },
                                                            "resources": [
                                                                                                                        {
                                                                                                                                                                                    "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                                                                                                                                                                                    "name": "[concat('sandbox2-la-001', '/Microsoft.SecurityInsights/', '2937bc6b-7cda-4fba-b452-4778adb440f3')]",
                                                                                                                                                                                    "apiVersion": "2020-01-01",
                                                                                                                                                                                    "kind": "Scheduled",
                                                                                                                                                                                    "location": "[resourceGroup().location]",
                                                                                                                                                                                    "properties": {
                                                                                                                                                                                                                                                "description": "This query identifies Active Directory computer objects modifications that allow an adversary to abuse the Resource-based constrained delegation. \nThis query checks for event id 5136 that the Object Class field is \"computer\" and the LDAP Display Name is \"msDS-AllowedToActOnBehalfOfOtherIdentity\" which is an indicator of Resource-based constrained delegation.\nRef: https://shenaniganslabs.io/2019/01/28/Wagging-the-Dog.html",
                                                                                                                                                                                                                                                "displayName": "Possible Resource-Based Constrained Delegation Abuse",
                                                                                                                                                                                                                                                "enabled": false,
                                                                                                                                                                                                                                                "query": "SecurityEvent\n| where EventID == 5136 \n| parse EventData with * 'ObjectClass\">' ObjectClass \"<\" *\n| parse EventData with * 'AttributeLDAPDisplayName\">' AttributeLDAPDisplayName \"<\" *\n| where ObjectClass == \"computer\" and AttributeLDAPDisplayName == \"msDS-AllowedToActOnBehalfOfOtherIdentity\"\n| parse EventData with * 'ObjectDN\">' ObjectDN \"<\" *\n| summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by Computer, SubjectAccount, SubjectUserSid, SubjectLogonId, ObjectDN, AttributeLDAPDisplayName\n",
                                                                                                                                                                                                                                                "queryFrequency": "PT1H",
                                                                                                                                                                                                                                                "queryPeriod": "PT1H",
                                                                                                                                                                                                                                                "severity": "Medium",
                                                                                                                                                                                                                                                "suppressionDuration": "PT1H",
                                                                                                                                                                                                                                                "suppressionEnabled": false,
                                                                                                                                                                                                                                                "triggerOperator": "GreaterThan",
                                                                                                                                                                                                                                                "triggerThreshold": 0,
                                                                                                                                                                                                                                                "id": "2937bc6b-7cda-4fba-b452-4778adb440f3",
                                                                                                                                                                                                                                                "tactics": [
                                                                                                                                                                                                                                                                                                            "PrivilegeEscalation"
                                                                                                                                                                                                                                                ]
                                                                                                                                                                                    }
                                                                                                                        }
                                                            ]
}