{
                                                            "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
                                                            "contentVersion": "1.0.0.0",
                                                            "parameters": {
                                                                                                                        "log_analytics_workspace": {
                                                                                                                                                                                    "type": "String",
                                                                                                                                                                                    "defaultValue": "",
                                                                                                                                                                                    "metadata": {
                                                                                                                                                                                                                                                "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
                                                                                                                                                                                    }
                                                                                                                        }
                                                            },
                                                            "resources": [
                                                                                                                        {
                                                                                                                                                                                    "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                                                                                                                                                                                    "name": "[concat('sandbox2-la-001', '/Microsoft.SecurityInsights/', 'ca67c83e-7fff-4127-a3e3-1af66d6d4cad')]",
                                                                                                                                                                                    "apiVersion": "2020-01-01",
                                                                                                                                                                                    "kind": "Scheduled",
                                                                                                                                                                                    "location": "[resourceGroup().location]",
                                                                                                                                                                                    "properties": {
                                                                                                                                                                                                                                                "description": "Identifies instances of a base64 encoded PE file header seen in the process command line parameter.",
                                                                                                                                                                                                                                                "displayName": "Base64 encoded Windows process command-lines",
                                                                                                                                                                                                                                                "enabled": false,
                                                                                                                                                                                                                                                "query": "\n\nlet ProcessCreationEvents=() {\nlet processEvents=(union isfuzzy=true\n(SecurityEvent\n| where EventID==4688\n| where isnotempty(CommandLine)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Computer, Account = SubjectUserName, AccountDomain = SubjectDomainName,\nFileName = Process, CommandLine, ParentProcessName\n),\n(WindowsEvent\n| where EventID==4688\n| where EventData has \"TVqQAAMAAAAEAAA\"\n| extend CommandLine = tostring(EventData.CommandLine)\n| where isnotempty(CommandLine)\n| extend ParentProcessName = tostring(EventData.ParentProcessName)\n| extend NewProcessName = tostring(EventData.NewProcessName)\n| extend Process=tostring(split(NewProcessName, '\\\\')[-1])\n| extend SubjectUserName = tostring(EventData.SubjectUserName)\n| extend SubjectDomainName = tostring(EventData.SubjectDomainName)\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated), count() by Computer, Account = SubjectUserName, AccountDomain = SubjectDomainName,\nFileName = Process, CommandLine, ParentProcessName));\nprocessEvents};\nProcessCreationEvents\n| where CommandLine contains \"TVqQAAMAAAAEAAA\"\n| extend timestamp = StartTimeUtc, AccountCustomEntity = Account, HostCustomEntity = Computer\n",
                                                                                                                                                                                                                                                "queryFrequency": "P1D",
                                                                                                                                                                                                                                                "queryPeriod": "P1D",
                                                                                                                                                                                                                                                "severity": "Medium",
                                                                                                                                                                                                                                                "suppressionDuration": "PT1H",
                                                                                                                                                                                                                                                "suppressionEnabled": false,
                                                                                                                                                                                                                                                "triggerOperator": "GreaterThan",
                                                                                                                                                                                                                                                "triggerThreshold": 0,
                                                                                                                                                                                                                                                "id": "ca67c83e-7fff-4127-a3e3-1af66d6d4cad",
                                                                                                                                                                                                                                                "tactics": [
                                                                                                                                                                                                                                                                                                            "Execution",
                                                                                                                                                                                                                                                                                                            "DefenseEvasion"
                                                                                                                                                                                                                                                ]
                                                                                                                                                                                    }
                                                                                                                        }
                                                            ]
}