{
                                                            "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
                                                            "contentVersion": "1.0.0.0",
                                                            "parameters": {
                                                                                                                        "log_analytics_workspace": {
                                                                                                                                                                                    "type": "String",
                                                                                                                                                                                    "defaultValue": "",
                                                                                                                                                                                    "metadata": {
                                                                                                                                                                                                                                                "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
                                                                                                                                                                                    }
                                                                                                                        }
                                                            },
                                                            "resources": [
                                                                                                                        {
                                                                                                                                                                                    "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                                                                                                                                                                                    "name": "[concat('sandbox2-la-001', '/Microsoft.SecurityInsights/', 'd2e8fd50-8d66-11ec-b909-0242ac120002')]",
                                                                                                                                                                                    "apiVersion": "2020-01-01",
                                                                                                                                                                                    "kind": "Scheduled",
                                                                                                                                                                                    "location": "[resourceGroup().location]",
                                                                                                                                                                                    "properties": {
                                                                                                                                                                                                                                                "description": "This query detects remote desktop authentication attempts with a localhost source address which can indicate a tunneled login.\nRef: https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling",
                                                                                                                                                                                                                                                "displayName": "Potential Remote Desktop Tunneling",
                                                                                                                                                                                                                                                "enabled": false,
                                                                                                                                                                                                                                                "query": "SecurityEvent\n   | where EventID in (4624,4625) and LogonType in (10) and IpAddress in (\"::1\",\"127.0.0.1\")\n   | summarize StartTime = min(TimeGenerated), EndTime = max(TimeGenerated) by EventID, Computer, TargetUserName, TargetLogonId, LogonType, IpAddress\n",
                                                                                                                                                                                                                                                "queryFrequency": "PT1H",
                                                                                                                                                                                                                                                "queryPeriod": "PT1H",
                                                                                                                                                                                                                                                "severity": "Medium",
                                                                                                                                                                                                                                                "suppressionDuration": "PT1H",
                                                                                                                                                                                                                                                "suppressionEnabled": false,
                                                                                                                                                                                                                                                "triggerOperator": "GreaterThan",
                                                                                                                                                                                                                                                "triggerThreshold": 0,
                                                                                                                                                                                                                                                "id": "d2e8fd50-8d66-11ec-b909-0242ac120002",
                                                                                                                                                                                                                                                "tactics": [
                                                                                                                                                                                                                                                                                                            "CommandandControl"
                                                                                                                                                                                                                                                ]
                                                                                                                                                                                    }
                                                                                                                        }
                                                            ]
}