{
                                                            "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
                                                            "contentVersion": "1.0.0.0",
                                                            "parameters": {
                                                                                                                        "log_analytics_workspace": {
                                                                                                                                                                                    "type": "String",
                                                                                                                                                                                    "defaultValue": "",
                                                                                                                                                                                    "metadata": {
                                                                                                                                                                                                                                                "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
                                                                                                                                                                                    }
                                                                                                                        }
                                                            },
                                                            "resources": [
                                                                                                                        {
                                                                                                                                                                                    "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                                                                                                                                                                                    "name": "[concat('sandbox2-la-001', '/Microsoft.SecurityInsights/', 'f7c3f5c8-71ea-49ff-b8b3-148f0e346291')]",
                                                                                                                                                                                    "apiVersion": "2020-01-01",
                                                                                                                                                                                    "kind": "Scheduled",
                                                                                                                                                                                    "location": "[resourceGroup().location]",
                                                                                                                                                                                    "properties": {
                                                                                                                                                                                                                                                "description": "Detects successful signins using single factor authentication where the device, location, and ASN are abnormal.\n  Single factor authentications pose an opportunity to access compromised accounts, investigate these for anomalous occurrencess.\n  Ref: https://docs.microsoft.com/azure/active-directory/fundamentals/security-operations-devices#non-compliant-device-sign-in",
                                                                                                                                                                                                                                                "displayName": "Anomolous Single Factor Signin",
                                                                                                                                                                                                                                                "enabled": false,
                                                                                                                                                                                                                                                "query": "let known_locations = (SigninLogs\n  | where TimeGenerated between(ago(7d)..ago(1d))\n  | where ResultType == 0\n  | extend LocationDetail = strcat(Location, \"-\", LocationDetails.state)\n  | summarize by LocationDetail);\n  let known_asn = (SigninLogs\n  | where TimeGenerated between(ago(7d)..ago(1d))\n  | where ResultType == 0\n  | summarize by AutonomousSystemNumber);\n  SigninLogs\n  | where TimeGenerated > ago(1d)\n  | where ResultType == 0\n  | where isempty(DeviceDetail.deviceId)\n  | where AuthenticationRequirement == \"singleFactorAuthentication\"\n  | extend LocationDetail = strcat(Location, \"-\", LocationDetails.state)\n  | where AutonomousSystemNumber !in (known_asn) and LocationDetail !in (known_locations)\n",
                                                                                                                                                                                                                                                "queryFrequency": "P1D",
                                                                                                                                                                                                                                                "queryPeriod": "P7D",
                                                                                                                                                                                                                                                "severity": "Low",
                                                                                                                                                                                                                                                "suppressionDuration": "PT1H",
                                                                                                                                                                                                                                                "suppressionEnabled": false,
                                                                                                                                                                                                                                                "triggerOperator": "GreaterThan",
                                                                                                                                                                                                                                                "triggerThreshold": 0,
                                                                                                                                                                                                                                                "id": "f7c3f5c8-71ea-49ff-b8b3-148f0e346291",
                                                                                                                                                                                                                                                "tactics": [
                                                                                                                                                                                                                                                                                                            "InitialAccess"
                                                                                                                                                                                                                                                ]
                                                                                                                                                                                    }
                                                                                                                        }
                                                            ]
}