{
                                                            "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
                                                            "contentVersion": "1.0.0.0",
                                                            "parameters": {
                                                                                                                        "log_analytics_workspace": {
                                                                                                                                                                                    "type": "String",
                                                                                                                                                                                    "defaultValue": "",
                                                                                                                                                                                    "metadata": {
                                                                                                                                                                                                                                                "description": "The Microsoft Sentinel workspace into which the function will be deployed. Has to be in the selected Resource Group."
                                                                                                                                                                                    }
                                                                                                                        }
                                                            },
                                                            "resources": [
                                                                                                                        {
                                                                                                                                                                                    "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
                                                                                                                                                                                    "name": "[concat('sandbox2-la-001', '/Microsoft.SecurityInsights/', '55073036-bb86-47d3-a85a-b113ac3d9396')]",
                                                                                                                                                                                    "apiVersion": "2020-01-01",
                                                                                                                                                                                    "kind": "Scheduled",
                                                                                                                                                                                    "location": "[resourceGroup().location]",
                                                                                                                                                                                    "properties": {
                                                                                                                                                                                                                                                "description": "Detects a successful logon by a privileged account from an ASN not logged in from in the last 14 days.\n  Monitor these logons to ensure they are legitimate and identify if there are any similar sign ins.",
                                                                                                                                                                                                                                                "displayName": "Privileged User Logon from new ASN",
                                                                                                                                                                                                                                                "enabled": false,
                                                                                                                                                                                                                                                "query": "let admins=(IdentityInfo\n  | where AssignedRoles contains \"admin\"\n  | summarize by tolower(AccountUPN));\n  let known_asns = (\n  SigninLogs\n  | where TimeGenerated between(ago(14d)..ago(1d))\n  | where ResultType == 0\n  | summarize by AutonomousSystemNumber);\n  SigninLogs\n  | where TimeGenerated > ago(1d)\n  | where ResultType == 0\n  | where tolower(UserPrincipalName) in (admins)\n  | where AutonomousSystemNumber !in (known_asns)\n  | project-reorder TimeGenerated, UserPrincipalName, UserAgent, IpAddress, AutonomousSystemNumber\n",
                                                                                                                                                                                                                                                "queryFrequency": "P1D",
                                                                                                                                                                                                                                                "queryPeriod": "P7D",
                                                                                                                                                                                                                                                "severity": "Medium",
                                                                                                                                                                                                                                                "suppressionDuration": "PT1H",
                                                                                                                                                                                                                                                "suppressionEnabled": false,
                                                                                                                                                                                                                                                "triggerOperator": "GreaterThan",
                                                                                                                                                                                                                                                "triggerThreshold": 0,
                                                                                                                                                                                                                                                "id": "55073036-bb86-47d3-a85a-b113ac3d9396",
                                                                                                                                                                                                                                                "tactics": [
                                                                                                                                                                                                                                                                                                            "DefenseEvasion"
                                                                                                                                                                                                                                                ]
                                                                                                                                                                                    }
                                                                                                                        }
                                                            ]
}